// pages/articles/articles.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    article:[
      "冲浪是种什么样的感觉，很热血？很刺激？很COOL？相信没有体验过的人，绝对无法描述出这种感觉，当你征服这道浪的时候，你会感觉整个世界只属于你；想象一下，世界属于你，这感觉绝对很棒，当生活遇到困难，工作遇到挫折，感情遇到坑，不妨试试冲浪！当你轻松过后，冷静过后，一切困难将会迎刃而解。可能很多人会问，冲浪难学吗？不会游泳可以学吗？多久能学会吗？对于真心想学习，想体验，想了解冲浪运动的人来说，这些都不是问题。", "冲浪是种什么样的感觉，很热血？很刺激？很COOL？相信没有体验过的人，绝对无法描述出这种感觉，当你征服这道浪的时候，你会感觉整个世界只属于你；想象一下，世界属于你，这感觉绝对很棒，当生活遇到困难，工作遇到挫折，感情遇到坑，不妨试试冲浪！当你轻松过后，冷静过后，一切困难将会迎刃而解。可能很多人会问，冲浪难学吗？不会游泳可以学吗？多久能学会吗？对于真心想学习，想体验，想了解冲浪运动的人来说，这些都不是问题。"
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})